/*******************************************************************************
* 版权所有(C) pyhcx 2009
* 文件名称	: DataConvert.cpp
* 当前版本	: 1.0.0.1
* 作    者	: 彭勇 (pyhcx@foxmail.com)
* 设计日期	: 2009年3月31日
* 内容摘要	: 
* 修改记录	: 
* 日    期		版    本		修改人		修改摘要

********************************************************************************/
/**************************** 条件编译选项和头文件 ****************************/

#include "StdAfx.h"
#include "DataConvert.h"

/********************************** 宏、常量 **********************************/

/********************************** 数据类型 **********************************/

/************************************ 变量 ************************************/

/********************************** 函数实现 **********************************/

/*********************************** 类实现 ***********************************/

void CDataConvert::AddressToString(DWORD64 dwAddr64,LPTSTR ptszBuf,BOOL bAdd0x,int nChars)
{
	TCHAR atszAddr[32];
	_ui64tot(dwAddr64,atszAddr,16);

	int i = 0;

	if(bAdd0x)
	{
		ptszBuf[i++] = _T('0') ;
		ptszBuf[i++] = _T('x') ;
	}
	
	int nLen = _tcslen(atszAddr);
	while(nLen++ < nChars)
	{
		ptszBuf[i++] = _T('0') ;
	}

	ptszBuf[i] = 0 ;

	_tcscat(ptszBuf,atszAddr);
}