/*******************************************************************************
* 版权所有(C) pyhcx 2009
* 文件名称	: DataConvert.h
* 当前版本	: 1.0.0.1
* 作    者	: 彭勇 (pyhcx@foxmail.com)
* 设计日期	: 2009年3月31日
* 内容摘要	: 
* 修改记录	: 
* 日    期		版    本		修改人		修改摘要

********************************************************************************/
#ifndef __DATACONVERT_H_5BE51C5D_3AC4_4DEC_9819_2E4F5614A270__
#define __DATACONVERT_H_5BE51C5D_3AC4_4DEC_9819_2E4F5614A270__

/**********************************  头文件 ************************************/

#ifdef  __cplusplus
extern "C" {
#endif

/********************************** 常量和宏 **********************************/

/********************************** 数据类型 **********************************/

/********************************** 函数声明 **********************************/

/********************************** 类定义 ***********************************/

class CDataConvert
{
public:
	static void AddressToString(DWORD64 dwAddr64,LPTSTR ptszBuf,BOOL bAdd0x=FALSE,int nChars=0);
};

#ifdef  __cplusplus
}
#endif
#endif // end of __DATACONVERT_H_5BE51C5D_3AC4_4DEC_9819_2E4F5614A270__

