/*******************************************************************************
* 版权所有(C) pyhcx 2009
* 文件名称	: DumpFile.h
* 当前版本	: 1.0.0.1
* 作    者	: 彭勇 (pyhcx@foxmail.com)
* 设计日期	: 2009年3月31日
* 内容摘要	: 
* 修改记录	: 
* 日    期		版    本		修改人		修改摘要

********************************************************************************/
#ifndef __DUMPFILE_H_C59A4751_88FC_4119_A500_298A58B65B9D__
#define __DUMPFILE_H_C59A4751_88FC_4119_A500_298A58B65B9D__

/**********************************  头文件 ************************************/

#ifdef  __cplusplus
extern "C" {
#endif

/********************************** 常量和宏 **********************************/

/********************************** 数据类型 **********************************/

/********************************** 函数声明 **********************************/

/********************************** 类定义 ***********************************/

class CDumpFile
{
public:
	CDumpFile(LPCTSTR ptszFile);
	~CDumpFile(void);

	BOOL DumpInfo(PEXCEPTION_POINTERS pExceptionInfo);
	void Close();

private:
	HANDLE	m_hDumpFile ;
};


#ifdef  __cplusplus
}
#endif
#endif // end of __DUMPFILE_H_C59A4751_88FC_4119_A500_298A58B65B9D__


