/*******************************************************************************
* 版权所有(C) pyhcx 2009
* 文件名称	: ReportTool.h
* 当前版本	: 1.0.0.1
* 作    者	: 彭勇 (pyhcx@foxmail.com)
* 设计日期	: 2009年3月31日
* 内容摘要	: 
* 修改记录	: 
* 日    期		版    本		修改人		修改摘要

********************************************************************************/
#ifndef __REPORTTOOL_H_3C32FBC9_3AEE_43EB_868E_1C18212B5B50__
#define __REPORTTOOL_H_3C32FBC9_3AEE_43EB_868E_1C18212B5B50__

/**********************************  头文件 ************************************/

#ifdef  __cplusplus
extern "C" {
#endif

/********************************** 常量和宏 **********************************/

/********************************** 数据类型 **********************************/

/********************************** 函数声明 **********************************/

/********************************** 类定义 ***********************************/
class CReportTool
{
public:
	CReportTool(LPCTSTR ptszTool);
	~CReportTool(void);

	void BootReportTool(LPCTSTR ptszParam);

private:
	TCHAR m_atszTool[512];
};

#ifdef  __cplusplus
}
#endif
#endif // end of __REPORTTOOL_H_3C32FBC9_3AEE_43EB_868E_1C18212B5B50__


